dennisppaul/klangstrom-arduino/stm32/boards.txt
KLST_CORE.name=Klangstrom Board KLST_CORE (STM32H743II)

KLST_CORE.build.variant=KLST_CORE
KLST_CORE.build.board=KLST_CORE
KLST_CORE.build.cmsis_lib_gcc=arm_cortexM7lfsp_math
KLST_CORE.build.fpu=-mfpu=fpv5-d16
KLST_CORE.build.series=STM32H7xx
KLST_CORE.build.mcu=cortex-m7
KLST_CORE.upload.maximum_size=2097152
KLST_CORE.upload.maximum_data_size=884736
KLST_CORE.build.product_line=STM32H743xx

#
# COMMON
#

KLST_CORE.build.core=arduino
KLST_CORE.build.variant_h=variant_{build.board}.h
KLST_CORE.build.float-abi=-mfloat-abi=hard
KLST_CORE.build.ldscript=ldscript.ld
KLST_CORE.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
KLST_CORE.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
KLST_CORE.build.extra_flags=-DKLST_BOARD_{build.board} -DKLST_ARCH=1 -DKLANG_SAMPLES_PER_AUDIO_BLOCK={build.flags.audioblock} -DKLANG_AUDIO_RATE={build.flags.samplingrate} -DKLANG_DEBUG_LEVEL=2 -DKLANG_SIGNAL_TYPE=1 -DKLST_WAVETABLE_INTERPOLATE_SAMPLES=1 -DKLST_USE_CMSIS_DSP -DCORE_CALLBACK
KLST_CORE.compiler.cpp.std=gnu++17

#
# MENUS
#

# Audio Properties
KLST_CORE.menu.samplingrate.xx48000xx=48000Hz
KLST_CORE.menu.samplingrate.xx48000xx.build.flags.samplingrate=48000
KLST_CORE.menu.samplingrate.xx44100xx=44100Hz
KLST_CORE.menu.samplingrate.xx44100xx.build.flags.samplingrate=44100
KLST_CORE.menu.samplingrate.xx22050xx=22050Hz
KLST_CORE.menu.samplingrate.xx22050xx.build.flags.samplingrate=22050

KLST_CORE.menu.audioblock.128=128 samples
KLST_CORE.menu.audioblock.128.build.flags.audioblock=128
KLST_CORE.menu.audioblock.2048=2048 samples
KLST_CORE.menu.audioblock.2048.build.flags.audioblock=2048
KLST_CORE.menu.audioblock.1024=1024 samples
KLST_CORE.menu.audioblock.1024.build.flags.audioblock=1024
KLST_CORE.menu.audioblock.512=512 samples
KLST_CORE.menu.audioblock.512.build.flags.audioblock=512
KLST_CORE.menu.audioblock.256=256 samples
KLST_CORE.menu.audioblock.256.build.flags.audioblock=256
KLST_CORE.menu.audioblock.64=64 samples
KLST_CORE.menu.audioblock.64.build.flags.audioblock=64
KLST_CORE.menu.audioblock.32=32 samples
KLST_CORE.menu.audioblock.32.build.flags.audioblock=32

# Upload menu
KLST_CORE.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
KLST_CORE.menu.upload_method.swdMethod.upload.protocol=0
KLST_CORE.menu.upload_method.swdMethod.upload.options=-g
KLST_CORE.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

KLST_CORE.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
KLST_CORE.menu.upload_method.dfuMethod.upload.protocol=2
KLST_CORE.menu.upload_method.dfuMethod.upload.options=-g
KLST_CORE.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

# Serialx activation
KLST_CORE.menu.xserial.generic=Enabled (generic 'Serial')
KLST_CORE.menu.xserial.none=Enabled (no generic 'Serial')
KLST_CORE.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
KLST_CORE.menu.xserial.disabled=Disabled (No Serial support)
KLST_CORE.menu.xserial.disabled.build.xSerial=

# USB connectivity
KLST_CORE.menu.usb.none=None
KLST_CORE.menu.usb.CDCgen=CDC (generic 'Serial' supersede U(S)ART)
KLST_CORE.menu.usb.CDCgen.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC
KLST_CORE.menu.usb.CDC=CDC (no generic 'Serial')
KLST_CORE.menu.usb.CDC.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC -DDISABLE_GENERIC_SERIALUSB
KLST_CORE.menu.usb.HID=HID (keyboard and mouse)
KLST_CORE.menu.usb.HID.build.enable_usb={build.usb_flags} -DUSBD_USE_HID_COMPOSITE
KLST_CORE.menu.usb.DEVICE_Mouse=USB Device Mouse
KLST_CORE.menu.usb.DEVICE_Mouse.build.enable_usb=-DUSE_USBDEVICE -DUSBDEVICE_MOUSE_KEYBOARD -DUSBDEVICE_MOUSE -DHAL_HCD_MODULE_ENABLED -DHAL_PCD_MODULE_ENABLED
KLST_CORE.menu.usb.DEVICE_Keyboard=USB Device Keyboard
KLST_CORE.menu.usb.DEVICE_Keyboard.build.enable_usb=-DUSE_USBDEVICE -DUSBDEVICE_MOUSE_KEYBOARD -DUSBDEVICE_KEYBOARD -DHAL_HCD_MODULE_ENABLED -DHAL_PCD_MODULE_ENABLED
KLST_CORE.menu.usb.DEVICE_MIDI=USB Device MIDI
KLST_CORE.menu.usb.DEVICE_MIDI.build.enable_usb=-DUSE_USBDEVICE -DUSBDEVICE_MIDI -DHAL_HCD_MODULE_ENABLED -DHAL_PCD_MODULE_ENABLED
KLST_CORE.menu.usb.HOST=USB Host Mouse+Keyboard+MIDI
KLST_CORE.menu.usb.HOST.build.enable_usb=-DUSE_USBHOST -DHAL_HCD_MODULE_ENABLED -DHAL_PCD_MODULE_ENABLED
KLST_CORE.menu.usb.HOST_DEVICE_MOUSE=USB Host Mouse+Keyboard+MIDI + USB Device Mouse
KLST_CORE.menu.usb.HOST_DEVICE_MOUSE.build.enable_usb=-DUSE_USBHOST -DHAL_HCD_MODULE_ENABLED -DHAL_PCD_MODULE_ENABLED -DUSE_USBDEVICE -DUSBDEVICE_MOUSE_KEYBOARD -DUSBDEVICE_MOUSE
KLST_CORE.menu.usb.HOST_DEVICE_KEYBOARD=USB Host Mouse+Keyboard+MIDI + USB Device Keyboard
KLST_CORE.menu.usb.HOST_DEVICE_KEYBOARD.build.enable_usb=-DUSE_USBHOST -DHAL_HCD_MODULE_ENABLED -DHAL_PCD_MODULE_ENABLED -DUSE_USBDEVICE -DUSBDEVICE_MOUSE_KEYBOARD -DUSBDEVICE_KEYBOARD
KLST_CORE.menu.usb.HOST_DEVICE_MIDI=USB Host Mouse+Keyboard+MIDI + USB Device MIDI
KLST_CORE.menu.usb.HOST_DEVICE_MIDI.build.enable_usb=-DUSE_USBHOST -DHAL_HCD_MODULE_ENABLED -DHAL_PCD_MODULE_ENABLED -DUSE_USBDEVICE -DUSBDEVICE_MIDI
KLST_CORE.menu.xusb.FS=Low/Full Speed
KLST_CORE.menu.xusb.HS=High Speed
KLST_CORE.menu.xusb.HS.build.usb_speed=-DUSE_USB_HS
KLST_CORE.menu.xusb.HSFS=High Speed in Full Speed mode
KLST_CORE.menu.xusb.HSFS.build.usb_speed=-DUSE_USB_HS -DUSE_USB_HS_IN_FS

# Optimizations
KLST_CORE.menu.opt.osstd=Smallest (-Os default)
KLST_CORE.menu.opt.oslto=Smallest (-Os) with LTO
KLST_CORE.menu.opt.oslto.build.flags.optimize=-Os -flto
KLST_CORE.menu.opt.o1std=Fast (-O1)
KLST_CORE.menu.opt.o1std.build.flags.optimize=-O1
KLST_CORE.menu.opt.o1lto=Fast (-O1) with LTO
KLST_CORE.menu.opt.o1lto.build.flags.optimize=-O1 -flto
KLST_CORE.menu.opt.o2std=Faster (-O2)
KLST_CORE.menu.opt.o2std.build.flags.optimize=-O2
KLST_CORE.menu.opt.o2lto=Faster (-O2) with LTO
KLST_CORE.menu.opt.o2lto.build.flags.optimize=-O2 -flto
KLST_CORE.menu.opt.o3std=Fastest (-O3)
KLST_CORE.menu.opt.o3std.build.flags.optimize=-O3
KLST_CORE.menu.opt.o3lto=Fastest (-O3) with LTO
KLST_CORE.menu.opt.o3lto.build.flags.optimize=-O3 -flto
KLST_CORE.menu.opt.ogstd=Debug (-Og)
KLST_CORE.menu.opt.ogstd.build.flags.optimize=-Og

# Debug information
KLST_CORE.menu.dbg.none=None
KLST_CORE.menu.dbg.enable=Enabled (-g)
KLST_CORE.menu.dbg.enable.build.flags.debug=-g

# C Runtime Library
KLST_CORE.menu.rtlib.nano=Newlib Nano (default)
KLST_CORE.menu.rtlib.nanofp=Newlib Nano + Float Printf
KLST_CORE.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
KLST_CORE.menu.rtlib.nanofs=Newlib Nano + Float Scanf
KLST_CORE.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
KLST_CORE.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
KLST_CORE.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
KLST_CORE.menu.rtlib.full=Newlib Standard
KLST_CORE.menu.rtlib.full.build.flags.ldspecs=
